Examinator/src/Documents/ПрохождениеПрограммыОбученияСУО/ПрохождениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеПрограммыОбученияСУО</name>
  <registerRecords>InformationRegister.ПрохожденияПрограммОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.РасписаниеПрограммОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиПрограммОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <comment>Учебная группа, в рамках которой пользователь проходит Проведение программы обучения.</comment>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Examinator/src/InformationRegisters/ДокументыТребующиеПерепроведенияСУО/ДокументыТребующиеПерепроведенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыТребующиеПерепроведенияСУО</name>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаписиДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПодчиненныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/РасписаниеПрограммОбученияСУО/РасписаниеПрограммОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеПрограммОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/УчастникиПрограммОбученияСУО/УчастникиПрограммОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиПрограммОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПрохожденияПрограммОбученияСУО/ПрохожденияПрограммОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрохожденияПрограммОбученияСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийПрограммыОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/ПроведениеПрограммыОбученияСУО/ПроведениеПрограммыОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеПрограммыОбученияСУО</name>
  <basedOn>Catalog.КаталогПрограммОбученияСУО</basedOn>
  <registerRecords>InformationRegister.ОткрытыеПрограммыОбученияСУО</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>БезСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.КаталогПрограммОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытаяПрограмма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляВсех</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗаявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоУчастников</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОткрытойПрограммыДляУчастника</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытоДляРуководителей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросНаОбучение</name>
    <type>
      <types>DocumentRef.ЗапросНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляУчастника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъектаКопирования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/СообщениеСУО/СообщениеСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СообщениеСУО</name>
  <basedOn>Catalog.ШаблоныСообщенийСУО</basedOn>
  <registerRecords>InformationRegister.ТемыПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.СообщенияТемСУО</registerRecords>
  <registerRecords>InformationRegister.ТемыМодераторовСУО</registerRecords>
  <registerRecords>InformationRegister.ЛичныеСообщенияПользователейСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяТекстовыйДокумент</name>
    <comment>Введено для сохранения оригинала сообщения из веб-кабинета</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовыйДокумент</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеВТеме</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>DocumentRef.НовостьСУО</types>
      <types>CatalogRef.ШаблоныСообщенийСУО</types>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.РассылкаСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоЭлектроннаяПочта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеСообщение</name>
    <type>
      <types>DocumentRef.СообщениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленоМодератором</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУдаленияМодератором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалившийМодератор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПеременных</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеАдреса</name>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Documents/ПрохождениеПрограммыОбученияСУО/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Делаем проверки возможности записи документа
	
	Если Ссылка.Пустая() Тогда

		ПрохождениеПрограммыОбучения = Документы.ПроведениеПрограммыОбученияСУО.ПрохождениеПрограммыОбучения(ПроведениеПрограммыОбучения, Пользователь);
		
		Если ЗначениеЗаполнено(ПрохождениеПрограммыОбучения) Тогда
			Текст = НСтр("ru = 'Пользователь ""%1"" уже зачислен на программу обучения ""%2"" (""%3"")'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Пользователь, Сценарий, ПрохождениеПрограммыОбучения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ДокументПроведениеПрограммыОбученияПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроведениеПрограммыОбучения, "Проведен");
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ ДокументПроведениеПрограммыОбученияПроведен Тогда
		Текст = НСтр("ru = 'Создание или изменение прохождения программы обучения ""%3"" пользователя ""%2"" не может быть выполнено, так как документ ""%1"" не проведен'");
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, ПроведениеПрограммыОбучения, Пользователь, Сценарий);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() Тогда	
		ДанныеСуществующегоПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ПометкаУдаления");		
		Если НЕ ПометкаУдаления И ДанныеСуществующегоПрохождения.ПометкаУдаления И РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
			РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(Ссылка, РежимЗаписиДокумента.Проведение, Ложь, 0, 3);
		КонецЕсли;		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("СоздатьАвтоматическуюРассылку", Ложь);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ Проведен Тогда
		ДополнительныеСвойства.СоздатьАвтоматическуюРассылку = Истина;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Движения
	
	Движения.РасписаниеПрограммОбученияСУО.Записывать            = Истина;
	Движения.УчастникиПрограммОбученияСУО.Записывать             = Истина;
	Движения.ПрохожденияПрограммОбученияСУО.Записывать           = Истина;
	
	ПрохождениеОтменено = Документы.ПрохождениеПрограммыОбученияСУО.Отменено(Ссылка);
	
	Если НЕ ПрохождениеОтменено Тогда
		
		ШкалаОценки = Документы.ПроведениеПрограммыОбученияСУО.ШкалаОценки(ПроведениеПрограммыОбучения);
		ДанныеОПроведенииПрограммыОбучения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПроведениеПрограммыОбучения, "ДатаНачалаПроведения, ДатаОкончанияПроведения");
		
		
		Движение = Движения.РасписаниеПрограммОбученияСУО.Добавить();

		Движение.Баллы                        = Баллы;
		Движение.ЗавершеноВПроцентах          = ЗавершеноВПроцентах;
		Движение.Пользователь                 = Пользователь;
		Движение.Статус                       = Статус;
		Движение.ПроведениеПрограммыОбучения  = ПроведениеПрограммыОбучения;
		Движение.Сценарий                     = Сценарий;
		Движение.УчебнаяГруппа                = УчебнаяГруппа;
		Движение.ШкалаОценки                  = ШкалаОценки;
		Движение.ДатаНачалаПроведения         = ДанныеОПроведенииПрограммыОбучения.ДатаНачалаПроведения;
		Движение.ДатаОкончанияПроведения      = ДанныеОПроведенииПрограммыОбучения.ДатаОкончанияПроведения;
		
		
		Движение = Движения.ПрохожденияПрограммОбученияСУО.Добавить();
		Движение.Период                       = Дата;
		Движение.Пользователь                 = Пользователь;
		Движение.Сценарий                     = Сценарий;
		Движение.Баллы                        = Баллы;
		Движение.ЗавершеноВПроцентах          = ЗавершеноВПроцентах;
		Движение.Статус                       = Статус;
		Движение.УчебнаяГруппа                = УчебнаяГруппа;
		Движение.ПроведениеПрограммыОбучения  = ПроведениеПрограммыОбучения;
		Движение.ШкалаОценки                  = ШкалаОценки;
		Движение.ДатаНачалаПроведения         = ДанныеОПроведенииПрограммыОбучения.ДатаНачалаПроведения;
		Движение.ДатаОкончанияПроведения      = ДанныеОПроведенииПрограммыОбучения.ДатаОкончанияПроведения;
		
		
		Движение = Движения.УчастникиПрограммОбученияСУО.Добавить();
		Движение.ПроведениеПрограммыОбучения = ПроведениеПрограммыОбучения;
		Движение.Пользователь                = Пользователь;
		Движение.Баллы                       = Баллы;
		Движение.ЗавершеноВПроцентах         = ЗавершеноВПроцентах;
		Движение.Статус                      = Статус;
		Движение.УчебнаяГруппа               = УчебнаяГруппа;
		Движение.ШкалаОценки                 = ШкалаОценки;
				
	КонецЕсли;

	Движения.Записать(); // Записываем движения
	
	// Создание рассылки
		
	Если НЕ ПрохождениеОтменено
		И ДополнительныеСвойства.Свойство("СоздатьАвтоматическуюРассылку")
		И ДополнительныеСвойства.СоздатьАвтоматическуюРассылку Тогда
				
		УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ЭтотОбъект);

	КонецЕсли;
	
	// Перепроводим подчиненные документы
				
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.ОтменаПроведения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОбновитьПодчиненныеДокументы(РежимЗаписи)
	
	ОбновлятьПодчиненныеДокументы = УправлениеОбучениемСУО.МожноОбновлятьПодчиненныеДокументы(ЭтотОбъект);
	
	// Примечание: выбираем только те прохождения, которые могут быть проведены,
	// то есть проведен соответствующий им документ "Проведение обучения".
	
	Запрос = Новый Запрос;
	
	Если ОбновлятьПодчиненныеДокументы Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеОбученияСУО.Ссылка
			|ИЗ
			|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
			|ГДЕ
			|	ПрохождениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПрохождениеОбученияСУО.ПрохождениеПрограммыОбучения = &ПрохождениеПрограммыОбучения
			|	И ПрохождениеОбученияСУО.ПроведениеОбучения.Проведен = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СообщениеСУО.Ссылка
			|ИЗ
			|	Документ.СообщениеСУО КАК СообщениеСУО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
			|		ПО СообщениеСУО.Тема = ТемыСообщенийСУО.Ссылка
			|ГДЕ
			|	ТемыСообщенийСУО.Контекст = &ПроведениеПрограммыОбучения
			|	И СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА
			|	И СообщениеСУО.ПометкаУдаления = ЛОЖЬ
			|	И СообщениеСУО.Проведен = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СообщениеСУО.Ссылка
			|ИЗ
			|	Документ.СообщениеСУО КАК СообщениеСУО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
			|		ПО СообщениеСУО.Тема = ТемыСообщенийСУО.Ссылка
			|ГДЕ
			|	СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА
			|	И ТемыСообщенийСУО.Контекст = &ПрохождениеПрограммыОбучения
			|	И СообщениеСУО.ПометкаУдаления = ЛОЖЬ
			|	И СообщениеСУО.Проведен = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СертификатСУО.Ссылка
			|ИЗ
			|	Документ.СертификатСУО КАК СертификатСУО
			|ГДЕ
			|	СертификатСУО.ПометкаУдаления = ЛОЖЬ
			|	И СертификатСУО.ПрохождениеОбучения = &ПрохождениеПрограммыОбучения";
		
		Запрос.УстановитьПараметр("ПроведениеПрограммыОбучения", ПроведениеПрограммыОбучения);
		
	Иначе
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПрохождениеОбученияСУО.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
			|ГДЕ
			|	ПрохождениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
			|	И ПрохождениеОбученияСУО.Проведен = ЛОЖЬ
			|	И ПрохождениеОбученияСУО.ПрохождениеПрограммыОбучения = &ПрохождениеПрограммыОбучения
			|	И ПрохождениеОбученияСУО.ПроведениеОбучения.Проведен = ИСТИНА";		
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПрохождениеПрограммыОбучения", Ссылка);	
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи, РежимЗаписи,,3,Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
